arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro300_cd4094/esp32_pro300_cd4094.ino
/**
 * S.G Representación — Plaqueta "PRO300 con control" (ESP32 + 2x CD4094)
 * ----------------------------------------------------------------------
 * Fase B: el ESP32 baja los 48 parámetros AR01–AR48 desde Supabase
 *         (Edge Function `fetch-pro300-params`, tabla `combistatos.params`).
 *
 * Hardware:
 *   - ESP32 (DOIT DevKit / NodeMCU-32S).
 *   - 2 NTC 10k beta 3950: NTC1 GPIO34 (cámara/ambiente), NTC2 GPIO35 (evaporador).
 *     Divisor a 3.3V con R_fixed=10k (NTC arriba, R a GND).
 *   - 2x CD4094 en cascada por SPI:
 *       4094 #1 = byte SEGMENTOS (a..g + dp), 7-seg activo en LOW.
 *       4094 #2 = bit 0..4 COM1..COM5 (4 dígitos + fila luces)
 *                 bit 5 RELAY COMPRESOR  (activo LOW)
 *                 bit 6 RELAY DESHIELO   (activo LOW)
 *                 bit 7 RELAY VENTILADOR (activo LOW)
 *   - SPI:  DATA=23 (MOSI), CLOCK=18 (SCK), STROBE=5 (latch).
 *   - DOOR_PIN: opcional. Si tu plaqueta tiene microswitch de puerta cableado
 *               a un GPIO, cambiá `DOOR_PIN` y se activa toda la lógica AR35–AR41.
 *               Con -1 (default) los parámetros se guardan pero no se accionan.
 *
 * Provisión: portal cautivo WiFiManager con campos para Supabase.
 *   1) Primer arranque (sin config) → AP "PRO300-Setup" abierto por 5 min.
 *   2) GPIO0 (botón BOOT) a GND al energizar → fuerza portal.
 *   3) Comando serie `portal` → abre portal en caliente.
 *
 *   Campos del portal:
 *     - WiFi SSID / Pass         (lo pone WiFiManager solo)
 *     - module_id                (alta del PRO300 en la app S.G)
 *     - api_key                  (token de 6 dígitos del alta)
 *     - api_url                  (https://<proyecto>.functions.supabase.co/functions/v1/ingest-reading)
 *
 *   Todo se guarda en LittleFS:
 *     - `/config.json` → credenciales + URL ingest (raro que cambien)
 *     - `/params.json` → últimos AR01–AR48 sincronizados desde la nube
 *
 * Comandos por puerto serie (115200, Newline):
 *     portal         → re-abre portal cautivo
 *     reset          → borra config y reinicia (vuelve a primer arranque)
 *     config         → muestra config + parámetros AR vigentes
 *     pull           → fuerza un pull de AR desde la nube
 *     temp           → display en modo temperatura
 *     off            → apaga compresor/vent/deshielo y muestra "OFF"
 *     defrost        → fuerza un ciclo de deshielo ahora
 *     <texto libre>  → marquesina en el display
 *
 * Dependencias (Arduino Library Manager):
 *   - WiFiManager   (tzapu)
 *   - ArduinoJson   (Benoit Blanchon, v6)
 *   El resto (WiFi, HTTPClient, LittleFS, esp_task_wdt, SPI) viene con el core ESP32.
 */

#include <WiFi.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <esp_task_wdt.h>
#include <SPI.h>
#include <math.h>

// ============== PINES =======================
#define DATA_PIN          23
#define CLOCK_PIN         18
#define STROBE_PIN        5
#define NTC1_PIN          34   // sonda cámara / ambiente
#define NTC2_PIN          35   // sonda evaporador
#define PIN_FORCE_PORTAL  0    // BOOT button: a GND al arranque → fuerza portal
#define DOOR_PIN         -1    // -1 = sin sensor de puerta; cambialo a un GPIO si lo cableaste

// ============== NTC =========================
static constexpr float R_FIXED = 10000.0f;
static constexpr float BETA    = 3950.0f;
static constexpr float T0K     = 298.15f;
static constexpr float R0      = 10000.0f;
static constexpr float TEMP_ERR_VALUE = -127.0f;

// ============== LAYOUT 4094 #2 ==============
#define BIT_COM1 0
#define BIT_COM2 1
#define BIT_COM3 2
#define BIT_COM4 3
#define BIT_COM5 4
#define BIT_COMP 5
#define BIT_DEF  6
#define BIT_FAN  7

// ============== CONFIG ======================
static constexpr const char *CFG_PATH       = "/config.json";
static constexpr const char *PARAMS_PATH    = "/params.json";
static constexpr const char *AP_NAME        = "PRO300-Setup";
static constexpr unsigned long PORTAL_TIMEOUT_SEC   = 5UL * 60UL;
static constexpr unsigned long WIFI_BOOT_CONNECT_MS = 20000UL;
static constexpr unsigned long TELEMETRY_DEFAULT_MS = 30000UL;
static constexpr unsigned long PARAMS_PULL_MS       = 2UL * 60UL * 1000UL;  // 2 min

struct Cfg {
  char apiUrl[200]   = "https://fohbhymulrmdsgrubtlo.supabase.co/functions/v1/ingest-reading";
  char moduleId[64]  = "";
  char apiKey[48]    = "";
  uint32_t intervalMs = TELEMETRY_DEFAULT_MS;
} g_cfg;

/**
 * Parámetros AR01–AR48 (claves F01–F55 + F52t alineadas con la app `combistato-params.defaults.ts`).
 * Defaults idénticos a la app: si el dispositivo arranca sin /params.json y no logra contactar
 * con la nube todavía, queda con los mismos valores que muestra el formulario en la UI.
 */
struct Params {
  // Termostato
  float F01 = -18.0f;   // AR01 setpoint °C
  float F02 = 3.0f;     // AR02 histéresis °C
  float F03 = 0.0f;     // AR03 corrección S1 (sumar al leído)
  float F04 = 0.0f;     // AR04 corrección S2
  float F49 = 0.0f;     // AR05 modo: 0=frío, 1=calor
  float F50 = 0.0f;     // AR06 inversión de relés: 0=activo LOW (default), 1=activo HIGH
  float F53 = 0.0f;     // AR07 sonda que controla termostato: 0=S1, 1=S2
  float F54 = 4.0f;     // AR08 muestras promedio ADC (4–32)

  // Deshielo
  float F05 = 0.0f;     // AR09 tipo de deshielo (0=eléctrico)
  float F06 = 360.0f;   // AR10 intervalo entre deshielos (min)
  float F07 = 30.0f;    // AR11 tiempo máx deshielo (min)
  float F08 = 8.0f;     // AR12 temp fin deshielo (S2, °C)
  float F09 = 0.0f;     // AR13 deshielo al encender (0/1)
  float F38 = 30.0f;    // AR14 retardo al encender (s)
  float F39 = 3.0f;     // AR15 tiempo de goteo (min)
  float F45 = 10.0f;    // AR16 bloqueo deshielo desde encendido (min)
  float F46 = 1440.0f;  // AR17 máx sin deshielo → forzar (min)
  float F52 = 0.0f;     // AR18 habilitar deshielo por temperatura (0/1)
  float F52t = -28.0f;  // AR19 umbral de hielo en evaporador (°C)

  // Ventilador
  float F10 = 0.0f;     // AR20 ventilador durante deshielo (0/1)
  float F11 = 2.0f;     // AR21 retardo vent post-deshielo (min)
  float F12 = -5.0f;    // AR22 temp evap para arrancar vent post-deshielo (°C)
  float F51 = 0.0f;     // AR23 ventilador continuo (0=solo con compresor, 1=siempre)

  // Alarmas
  float F13 = 10.0f;    // AR24 alarma temp alta (°C)
  float F14 = -30.0f;   // AR25 alarma temp baja (°C)
  float F15 = 5.0f;     // AR26 retardo alarma térmica (min)
  float F16 = 1.0f;     // AR27 alarma por sonda falla (0/1)
  float F47 = 1.0f;     // AR28 histéresis de alarma (°C)
  float F48 = 5.0f;     // AR29 retardo alarmas al encender (min)

  // Compresor (tiempos de protección)
  float F17 = 60.0f;    // AR30 tmin OFF compresor (s)
  float F18 = 30.0f;    // AR31 tmin ON compresor  (s)
  float F19 = 300.0f;   // AR32 emergencia ON  (s, con sonda fallada)
  float F20 = 300.0f;   // AR33 emergencia OFF (s, con sonda fallada)
  float F55 = 1.0f;     // AR34 acción ante falla de sonda (0=apaga / 1=emergencia)

