arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro300_cd4094/esp32_pro300_cd4094.ino
  // Puerta (requiere hardware DOOR_PIN configurado)
  float F25 = 0.0f;     // AR35 habilitar entrada de puerta (0/1)
  float F26 = 1.0f;     // AR36 contacto puerta (0=NC, 1=NO)
  float F27 = 120.0f;   // AR37 retardo alarma puerta abierta (s)
  float F28 = 1.0f;     // AR38 apagar vent con puerta abierta
  float F29 = 0.0f;     // AR39 bloquear alarmas térmicas con puerta abierta
  float F30 = 0.0f;     // AR40 registrar evento puerta por Serial
  float F40 = 0.0f;     // AR41 apagar compresor con puerta abierta

  // Comandos manuales por serie (los gestiona leerSerial)
  float F31 = 0.0f;     // AR42 permitir compresor manual por Serial
  float F32 = 30.0f;    // AR43 tiempo máx compresor manual (min)
  float F33 = 0.0f;     // AR44 permitir ventilador manual por Serial
  float F34 = 30.0f;    // AR45 tiempo máx ventilador manual (min)
  float F35 = 0.0f;     // AR46 permitir deshielo manual por Serial
  float F36 = 30.0f;    // AR47 tiempo mínimo entre deshielos manuales (min)
  float F37 = 0.0f;     // AR48 deshielo inmediato cuando se pide (0/1)
} P;

static String g_paramsUpdatedAt = "";    // marca devuelta por la nube; permite saber cuándo cambió

// ============== ESTADO ======================
enum WifiState { WFS_BOOT, WFS_PORTAL, WFS_RUNNING };
static WifiState g_wifiState = WFS_BOOT;

// Fase actual del controlador (se reporta en cada telemetría para que la app
// muestre Transcurrido/Faltan/etc. en la card. Pasa por cada bloque del loop
// de control y se cambia con setPhase()).
enum Phase { PH_OFF, PH_BOOT, PH_NORMAL, PH_DEFROST, PH_DRIP, PH_POST_DEFROST, PH_EMERG };
static Phase g_phase = PH_BOOT;
static unsigned long g_phaseStartedAt = 0;
static uint32_t g_phaseTotalS = 0;

static const char *phaseName(Phase p) {
  switch (p) {
    case PH_OFF:           return "off";
    case PH_BOOT:          return "boot";
    case PH_NORMAL:        return "normal";
    case PH_DEFROST:       return "defrost";
    case PH_DRIP:          return "drip";
    case PH_POST_DEFROST:  return "post_defrost";
    case PH_EMERG:         return "emerg";
  }
  return "normal";
}

static void setPhase(Phase p, uint32_t totalS) {
  if (g_phase == p) {
    // Misma fase: solo refrescamos `phase_total_s` por si un parámetro AR
    // cambió desde la nube (p.ej. AR10 / F06 mientras estamos refrigerando).
    // El cronómetro de inicio se preserva para no resetear el "Transcurrido".
    g_phaseTotalS = totalS;
    return;
  }
  g_phase = p;
  g_phaseStartedAt = millis();
  g_phaseTotalS = totalS;
}

static bool compresor=false, ventilador=false, deshielo=false, dripping=false;
static unsigned long compChangedAt=0, defStartedAt=0, dripStartedAt=0;
static unsigned long lastDefrostAt=0, lastReadAt=0;
static unsigned long lastDisplaySwitchAt=0, bootAtMs=0;
static bool   bootDelayDone = false;   // F38 retardo al encender consumido
static bool   defrostOnStartDone = false; // F09: ya disparado el deshielo de arranque

// Alarmas locales (espejo de lo que también podría calcular el backend)
static bool   alarmHigh=false, alarmLow=false, alarmProbe=false;
static unsigned long alarmHighSinceMs=0, alarmLowSinceMs=0;

// Puerta (solo activo si DOOR_PIN != -1)
static bool  doorOpen=false;
static unsigned long doorChangedAt=0;
static bool  doorAlarm=false;

// Emergencia (sonda fallada, F19/F20)
static unsigned long emergencyChangedAt=0;
static bool          emergencyComp=false;

static float tCam  = TEMP_ERR_VALUE;
static float tEvap = TEMP_ERR_VALUE;
static bool  fault1=true, fault2=true;

static bool   modoTexto = true;
static String texto = "BOOT";
static int    scrollPos = 0;

static byte bufferDisplay[4] = {0xFF, 0xFF, 0xFF, 0xFF};
static int  digitNow = 0;
static unsigned long lastScroll=0;

// Task dedicada a HTTP (telemetría + pull). Corre en core 0 para no bloquear
// la multiplexación del display (que está en el loopTask = core 1).
static TaskHandle_t g_netTaskHandle = NULL;
// Task dedicada exclusivamente al refresco multiplexado del 7-seg. Corre en
// core 1 con prioridad mayor que el loopTask, así ningún cálculo / log /
// portal / NTC le roba ciclos al display (causa principal de parpadeo).
static TaskHandle_t g_displayTaskHandle = NULL;
static bool         g_pullNowRequested = false;   // pedido desde serie
// Banderas seteadas desde la network task (core 0) y leídas por el loop (core 1)
// para mostrar un scroll efímero en el display cuando se envió/actualizó.
static volatile bool g_flashTelemetrySent = false;
static volatile bool g_flashParamsUpdated = false;
static bool          g_flashActive        = false;
static unsigned long g_flashEndsAt        = 0;

// ============== WiFiManager + portal ========
static WiFiManager wm;
static bool g_portalSaveRequested = false;
static unsigned long g_portalStartedAt = 0;
static WiFiManagerParameter p_module("module_id", "Module ID (alta PRO300)", "", 47);
static WiFiManagerParameter p_token("api_key", "Device Token (6+ chars)", "", 47);
static WiFiManagerParameter p_url("api_url", "Ingest URL", "", 199);

// ============== TABLAS 7-seg ================
static const byte num7seg[10] = {
  0b11000000, 0b11111001, 0b10100100, 0b10110000, 0b10011001,
  0b10010010, 0b10000010, 0b11111000, 0b10000000, 0b10010000
};
#define BLANCO 0b11111111
#define MENOS  0b10111111

static byte mapaChar(char c) {
  c = toupper(c);
  switch (c) {
    case '0': return num7seg[0]; case '1': return num7seg[1];
    case '2': return num7seg[2]; case '3': return num7seg[3];
    case '4': return num7seg[4]; case '5': return num7seg[5];
    case '6': return num7seg[6]; case '7': return num7seg[7];
    case '8': return num7seg[8]; case '9': return num7seg[9];
    case 'A': return 0b10001000; case 'B': return 0b10000011;
    case 'C': return 0b11000110; case 'D': return 0b10100001;
    case 'E': return 0b10000110; case 'F': return 0b10001110;
    case 'G': return 0b11000010; case 'H': return 0b10001001;
    case 'I': return 0b11111001; case 'J': return 0b11100001;
    case 'L': return 0b11000111; case 'N': return 0b10101011;
    case 'O': return 0b11000000; case 'P': return 0b10001100;
    case 'R': return 0b10101111; case 'S': return 0b10010010;
    case 'T': return 0b10000111; case 'U': return 0b11000001;
    case 'Y': return 0b10010001;
    case '-': return MENOS;      case ' ': return BLANCO;
    default:  return BLANCO;
  }
}

// ============== HELPERS 4094 ================
/**
 * AR06 (F50): si vale 1, los relays son activos HIGH en vez de activos LOW.
 * Por compatibilidad, la salida del 4094 es activa LOW por hardware; lo único
 * que cambia es la condición que activa cada bit (la electrónica suele tener
 * un transistor inversor o no).
 */
static byte relayMask() {
  byte b = 0;
  bool invert = P.F50 >= 0.5f;
  bool cON = invert ? !compresor  : compresor;
  bool dON = invert ? !deshielo   : deshielo;
  bool fON = invert ? !ventilador : ventilador;
  if (cON) b |= (1 << BIT_COMP);
  if (dON) b |= (1 << BIT_DEF);
  if (fON) b |= (1 << BIT_FAN);
  return b;
}
static byte comunesApagados() { return 0b00011111 | relayMask(); }
static byte activarCom(int com) {
  byte b = comunesApagados();
  b &= ~(1 << com);
  return b;
}
static void enviar4094(byte cm, byte sg) {
  digitalWrite(STROBE_PIN, LOW);
  SPI.transfer(cm);
  SPI.transfer(sg);
  digitalWrite(STROBE_PIN, HIGH);
  digitalWrite(STROBE_PIN, LOW);
}
static void refrescarDisplay() {
  enviar4094(comunesApagados(), 0xFF);
  if (digitNow < 4) {
    enviar4094(activarCom(digitNow), bufferDisplay[digitNow]);
  } else {
    byte luces = 0xFF;
    if (compresor)  luces &= ~(1 << 0);
    if (ventilador) luces &= ~(1 << 1);
    if (deshielo)   luces &= ~(1 << 2);
    enviar4094(activarCom(BIT_COM5), luces);
  }
  if (++digitNow > 4) digitNow = 0;
}

