arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro300_cd4094/esp32_pro300_cd4094.ino
// ============== DISPLAY: TEXTO Y TEMP =======
static String adaptarTexto(String t) {
  t.toUpperCase();
  // El 7-seg no tiene diagonales: la M la mostramos como N y la V como U para que
  // palabras como "ENVIADOS" se lean (queda "ENUIADOS").
  t.replace("M", "N");
  t.replace("V", "U");
  return t;
}
static void prepararTexto() {
  String t = "    " + adaptarTexto(texto) + "    ";
  for (int i = 0; i < 4; i++) {
    int idx = scrollPos + i;
    if (idx >= (int)t.length()) { bufferDisplay[i] = BLANCO; continue; }
    char c = t[idx];
    if (c == '.') {
      if (i > 0) bufferDisplay[i - 1] &= 0b01111111;
      bufferDisplay[i] = BLANCO;
    } else {
      bufferDisplay[i] = mapaChar(c);
    }
  }
  scrollPos++;
  if (scrollPos > (int)t.length() - 4) scrollPos = 0;
}
/**
 * Layout flush-right: el dígito 3 (más a la derecha) siempre lleva el decimal,
 * el dígito 2 lleva el punto, los dígitos 1 y 0 las decenas y el signo.
 * Ejemplos:  5.3 → "   5.3"   -8.5 → "  -8.5"   22.5 → "  22.5"   -22.5 → " -22.5"
 */
static void mostrarTemperatura(float temp) {
  for (int i = 0; i < 4; i++) bufferDisplay[i] = BLANCO;
  bool neg = temp < 0;
  if (neg) temp = -temp;
  int valor  = (int)round(temp * 10);
  int entero = valor / 10;
  int dec    = valor % 10;

  bufferDisplay[3] = num7seg[dec];

  if (entero >= 100) {
    bufferDisplay[0] = num7seg[(entero / 100) % 10];
    bufferDisplay[1] = num7seg[(entero / 10) % 10];
    bufferDisplay[2] = num7seg[entero % 10] & 0b01111111;
  } else if (entero >= 10) {
    bufferDisplay[1] = num7seg[entero / 10];
    bufferDisplay[2] = num7seg[entero % 10] & 0b01111111;
    if (neg) bufferDisplay[0] = MENOS;
  } else {
    bufferDisplay[2] = num7seg[entero] & 0b01111111;
    if (neg) bufferDisplay[1] = MENOS;
  }
}
static void mostrarError(int idx) {
  for (int i = 0; i < 4; i++) bufferDisplay[i] = BLANCO;
  bufferDisplay[1] = mapaChar('E');
  bufferDisplay[2] = num7seg[idx];
}

// ============== LECTURA NTC =================
/**
 * AR08 (F54) decide cuántas muestras tomamos por lectura (4–32). Aceptamos
 * más muestras = lectura más estable pero más lenta. Saturamos los extremos
 * para no quedarnos sin tiempo de loop si llega un valor raro de la nube.
 */
static float leerNTCpromedio(int pin, bool &fault, float offset) {
  int samples = (int)P.F54;
  if (samples < 4)  samples = 4;
  if (samples > 32) samples = 32;
  long acc = 0;
  int validas = 0;
  for (int i = 0; i < samples; i++) {
    int v = analogRead(pin);
    if (v > 5 && v < 4090) { acc += v; validas++; }
    delayMicroseconds(200);
  }
  if (validas < samples / 2) { fault = true; return TEMP_ERR_VALUE; }
  int adc = acc / validas;
  float rNTC = R_FIXED * ((float)adc / (4095.0f - (float)adc));
  float tK = 1.0f / ((1.0f / T0K) + (1.0f / BETA) * log(rNTC / R0));
  float tC = tK - 273.15f;
  if (tC < -45.0f || tC > 80.0f) { fault = true; return TEMP_ERR_VALUE; }
  fault = false;
  return tC + offset;
}

// ============== CONTROL helpers =============
/** AR07 (F53): qué sonda controla el termostato (0=cámara, 1=evaporador). */
static float controlTemp(bool &controlFault) {
  if (P.F53 >= 0.5f) { controlFault = fault2; return tEvap; }
  controlFault = fault1; return tCam;
}

/** AR05 (F49): comparador frío/calor. */
static bool needCooling(float t, float setp, float hist) {
  if (P.F49 >= 0.5f) {
    // Modo calor: prender cuando temp ≤ setp - hist; apagar al alcanzar setp.
    return t <= setp - hist;
  }
  // Modo frío (default).
  return t >= setp + hist;
}
static bool reachedSetpoint(float t, float setp) {
  if (P.F49 >= 0.5f) return t >= setp;
  return t <= setp;
}

// ============== Puerta (AR35–AR41) ==========
static void leerPuerta() {
  if (DOOR_PIN < 0 || P.F25 < 0.5f) { doorOpen = false; doorAlarm = false; return; }
  int v = digitalRead(DOOR_PIN);
  bool isOpenRaw = (P.F26 >= 0.5f) ? (v == HIGH) : (v == LOW);   // F26: 1=NO, 0=NC
  if (isOpenRaw != doorOpen) {
    doorOpen = isOpenRaw;
    doorChangedAt = millis();
    if (P.F30 >= 0.5f) Serial.printf("[PUERTA] %s\n", doorOpen ? "ABIERTA" : "CERRADA");
  }
  doorAlarm = doorOpen && (millis() - doorChangedAt) >= (unsigned long)(P.F27 * 1000.0f);
}

// ============== CONTROL principal ===========
static void aplicarControl() {
  unsigned long now = millis();

  // F38: retardo al encender — todo OFF hasta cumplir el delay.
  if (!bootDelayDone) {
    if (now - bootAtMs < (unsigned long)(P.F38 * 1000.0f)) {
      compresor = ventilador = deshielo = dripping = false;
      setPhase(PH_BOOT, (uint32_t)P.F38);
      return;
    }
    bootDelayDone = true;
    compChangedAt = now;
    lastDefrostAt = now;
    // F09: deshielo al encender.
    if (P.F09 >= 0.5f && !defrostOnStartDone) {
      deshielo = true; defStartedAt = now;
      defrostOnStartDone = true;
      setPhase(PH_DEFROST, (uint32_t)(P.F07 * 60.0f));
      return;
    }
    defrostOnStartDone = true;
  }

  // F46: si pasó "máx sin deshielo", forzar ciclo.
  bool forceDefrost = (P.F46 > 0) && (now - lastDefrostAt) >= (unsigned long)(P.F46 * 60.0f * 1000.0f);

  // F45: bloqueo de deshielo desde encendido (min).
  bool defrostBlockedByStartup = (now - bootAtMs) < (unsigned long)(P.F45 * 60.0f * 1000.0f);

  // ---- SONDAS FALLADAS ----
  bool ctrlFault;
  float tCtrl = controlTemp(ctrlFault);
  if (ctrlFault) {
    deshielo = false; dripping = false;
    if (P.F55 < 0.5f) {
      // AR34 = 0: apagar todo.
      if (compresor) { compresor = false; compChangedAt = now; }
      ventilador = false;
      setPhase(PH_OFF, 0);
      return;
    }
    // AR34 = 1: ciclo de emergencia F19 ON / F20 OFF (s)
    setPhase(PH_EMERG, 0);
    unsigned long onMs  = (unsigned long)(P.F19 * 1000.0f);
    unsigned long offMs = (unsigned long)(P.F20 * 1000.0f);
    if (emergencyComp) {
      if (now - emergencyChangedAt >= onMs) {
        emergencyComp = false; emergencyChangedAt = now;
      }
    } else {
      if (now - emergencyChangedAt >= offMs) {
        emergencyComp = true; emergencyChangedAt = now;
      }
    }
    compresor = emergencyComp;
    ventilador = compresor || P.F51 >= 0.5f;
    return;
  }
  emergencyComp = false;

  // ---- DESHIELO ----
  // Inicio: por tiempo de intervalo (F06) o forzado (F46) o por hielo (F52/F52t)
  bool defrostByIce = (P.F52 >= 0.5f) && !fault2 && (tEvap <= P.F52t);
  bool defrostByInterval = (P.F06 > 0) && (now - lastDefrostAt) >= (unsigned long)(P.F06 * 60.0f * 1000.0f);
  // AR09 (F05): tipo de deshielo
  //   0 = electrico  → relay deshielo ON, compresor OFF
  //   1 = gas caliente → relay deshielo ON + compresor ON (válvula 4 vías / inversion)
  //   2 = natural     → compresor OFF, sin resistencia, solo deja descongelar por inercia
  int defrostType = (int)P.F05;
  if (!deshielo && !dripping && !defrostBlockedByStartup &&
      (defrostByInterval || forceDefrost || defrostByIce)) {
    deshielo = true; defStartedAt = now;
    if (defrostType == 1) {
      // Gas caliente: fuerza compresor ON salteando el tmin (es prioritario).
      if (!compresor) { compresor = true; compChangedAt = now; }
    } else {
      if (compresor) { compresor = false; compChangedAt = now; }
    }
    // AR20 (F10): ventilador durante deshielo (0=apagado, 1=encendido).
    ventilador = (P.F10 >= 0.5f);
    setPhase(PH_DEFROST, (uint32_t)(P.F07 * 60.0f));
    return;
  }

