arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro300_cd4094/esp32_pro300_cd4094.ino
  if (deshielo) {
    bool finPorTemp = !fault2 && (tEvap >= P.F08);
    bool finPorTiempo = (now - defStartedAt) >= (unsigned long)(P.F07 * 60.0f * 1000.0f);
    if (finPorTiempo || finPorTemp) {
      deshielo = false;
      lastDefrostAt = now;
      dripping = true;
      dripStartedAt = now;
      // Si veníamos por gas caliente, apagamos compresor al cerrar el ciclo.
      if (defrostType == 1 && compresor) { compresor = false; compChangedAt = now; }
      setPhase(PH_DRIP, (uint32_t)(P.F39 * 60.0f));
    } else {
      ventilador = (P.F10 >= 0.5f);
      // Sostener compresor ON durante todo el deshielo por gas caliente.
      if (defrostType == 1 && !compresor) { compresor = true; compChangedAt = now; }
      setPhase(PH_DEFROST, (uint32_t)(P.F07 * 60.0f));
    }
    return;
  }

  // ---- GOTEO ----
  if (dripping) {
    // Apaga vent durante el goteo (estándar), salvo F51=1 (vent continuo).
    ventilador = (P.F51 >= 0.5f);
    if ((now - dripStartedAt) >= (unsigned long)(P.F39 * 60.0f * 1000.0f)) {
      dripping = false;
    } else {
      setPhase(PH_DRIP, (uint32_t)(P.F39 * 60.0f));
      return;
    }
  }

  // ---- TERMOSTATO ----
  float setp = P.F01;
  float hist = P.F02;
  unsigned long compMinOnMs  = (unsigned long)(P.F18 * 1000.0f);
  unsigned long compMinOffMs = (unsigned long)(P.F17 * 1000.0f);

  // Puerta abierta puede apagar compresor (F40) y ventilador (F28)
  bool doorCutsComp = (DOOR_PIN >= 0) && P.F25 >= 0.5f && P.F40 >= 0.5f && doorOpen;
  bool doorCutsFan  = (DOOR_PIN >= 0) && P.F25 >= 0.5f && P.F28 >= 0.5f && doorOpen;

  if (compresor) {
    bool wantOff = reachedSetpoint(tCtrl, setp) || doorCutsComp;
    if (wantOff && (now - compChangedAt) >= compMinOnMs) {
      compresor = false; compChangedAt = now;
    }
  } else {
    bool wantOn = needCooling(tCtrl, setp, hist) && !doorCutsComp;
    if (wantOn && (now - compChangedAt) >= compMinOffMs) {
      compresor = true; compChangedAt = now;
    }
  }

  // Ventilador: F51 continuo, F11 retardo post-deshielo, F12 umbral evap
  unsigned long postDefDelayMs = (unsigned long)(P.F11 * 60.0f * 1000.0f);
  bool postDefGate = (now - lastDefrostAt) >= postDefDelayMs;
  bool evapOK = fault2 ? true : (tEvap <= P.F12);
  bool fanLogic = P.F51 >= 0.5f ? true : (compresor && postDefGate && evapOK);
  if (doorCutsFan) fanLogic = false;
  ventilador = fanLogic;

  // Fase post-deshielo: dentro del retardo de ventilador (F11) tras un ciclo.
  // Si no hay retardo o ya pasó, fase normal (refrigeración).
  if (!postDefGate && P.F11 > 0) {
    setPhase(PH_POST_DEFROST, (uint32_t)(P.F11 * 60.0f));
  } else {
    // En "refrigeración" el "Faltan" que muestra la app es el tiempo hasta
    // el próximo deshielo por intervalo (AR10 / F06, en minutos, default
    // 360 min = 6 h). Para que `total - transcurrido` dé exactamente ese
    // countdown, anclamos el cronómetro al instante en que terminó el último
    // deshielo (lastDefrostAt), no al millis() actual.
    bool wasNormal = (g_phase == PH_NORMAL);
    setPhase(PH_NORMAL, (uint32_t)(P.F06 * 60.0f));
    if (!wasNormal) g_phaseStartedAt = lastDefrostAt;
  }
}

// ============== ALARMAS =====================
static void evaluarAlarmas() {
  unsigned long now = millis();
  bool startupGate = (now - bootAtMs) >= (unsigned long)(P.F48 * 60.0f * 1000.0f);
  unsigned long delayMs = (unsigned long)(P.F15 * 60.0f * 1000.0f);

  alarmProbe = (P.F16 >= 0.5f) && (fault1 || fault2);

  // Si la puerta está abierta y F29=1, bloquea alarmas térmicas.
  bool maskThermal = (DOOR_PIN >= 0) && P.F25 >= 0.5f && P.F29 >= 0.5f && doorOpen;

  if (fault1 || maskThermal || !startupGate) {
    alarmHigh = alarmLow = false;
    alarmHighSinceMs = alarmLowSinceMs = 0;
    return;
  }

  float hi = P.F13, lo = P.F14, hys = P.F47;
  // Histeresis para evitar parpadeo (F47).
  if (alarmHigh) {
    if (tCam < hi - hys) { alarmHigh = false; alarmHighSinceMs = 0; }
  } else {
    if (tCam >= hi) {
      if (alarmHighSinceMs == 0) alarmHighSinceMs = now;
      if (now - alarmHighSinceMs >= delayMs) alarmHigh = true;
    } else {
      alarmHighSinceMs = 0;
    }
  }
  if (alarmLow) {
    if (tCam > lo + hys) { alarmLow = false; alarmLowSinceMs = 0; }
  } else {
    if (tCam <= lo) {
      if (alarmLowSinceMs == 0) alarmLowSinceMs = now;
      if (now - alarmLowSinceMs >= delayMs) alarmLow = true;
    } else {
      alarmLowSinceMs = 0;
    }
  }
}

// ============== CONFIG: LittleFS ============
static bool ensureFs() {
  static bool done = false;
  if (done) return true;
  if (!LittleFS.begin(true)) {
    Serial.println(F("[FS] LittleFS.begin falló."));
    return false;
  }
  done = true;
  return true;
}
static bool loadConfig() {
  if (!ensureFs()) return false;
  if (!LittleFS.exists(CFG_PATH)) return false;
  File f = LittleFS.open(CFG_PATH, "r");
  if (!f) return false;
  StaticJsonDocument<512> doc;
  DeserializationError e = deserializeJson(doc, f);
  f.close();
  if (e) {
    Serial.printf("[CFG] JSON corrupto: %s\n", e.c_str());
    return false;
  }
  const char *u = doc["api_url"] | "";
  if (strncmp(u, "https://", 8) == 0 && strstr(u, "/functions/v1/")) {
    strlcpy(g_cfg.apiUrl, u, sizeof(g_cfg.apiUrl));
  }
  strlcpy(g_cfg.moduleId, doc["module_id"] | "", sizeof(g_cfg.moduleId));
  strlcpy(g_cfg.apiKey,   doc["api_key"]   | "", sizeof(g_cfg.apiKey));
  g_cfg.intervalMs = doc["interval_ms"] | g_cfg.intervalMs;
  if (g_cfg.intervalMs < 5000) g_cfg.intervalMs = 5000;
  return true;
}
static bool saveConfig() {
  if (!ensureFs()) return false;
  StaticJsonDocument<512> doc;
  doc["api_url"]     = g_cfg.apiUrl;
  doc["module_id"]   = g_cfg.moduleId;
  doc["api_key"]     = g_cfg.apiKey;
  doc["interval_ms"] = g_cfg.intervalMs;
  File f = LittleFS.open(CFG_PATH, "w");
  if (!f) return false;
  serializeJson(doc, f);
  f.close();
  return true;
}
static void resetConfig() {
  if (ensureFs()) {
    if (LittleFS.exists(CFG_PATH))    LittleFS.remove(CFG_PATH);
    if (LittleFS.exists(PARAMS_PATH)) LittleFS.remove(PARAMS_PATH);
  }
  WiFi.disconnect(true, true);
  delay(200);
  ESP.restart();
}

