arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro300_cd4094/esp32_pro300_cd4094.ino
// ============== PARAMS: LittleFS + Cloud =====
/** Lee P.* desde doc. Solo sobreescribe lo que viene; el resto queda con default. */
static void applyParamsFromJson(JsonObject obj) {
  #define ASSIGN(K) do { auto v = obj[#K]; if (!v.isNull()) P.K = v.as<float>(); } while (0)
  ASSIGN(F01); ASSIGN(F02); ASSIGN(F03); ASSIGN(F04); ASSIGN(F05);
  ASSIGN(F06); ASSIGN(F07); ASSIGN(F08); ASSIGN(F09); ASSIGN(F10);
  ASSIGN(F11); ASSIGN(F12); ASSIGN(F13); ASSIGN(F14); ASSIGN(F15);
  ASSIGN(F16); ASSIGN(F17); ASSIGN(F18); ASSIGN(F19); ASSIGN(F20);
  ASSIGN(F25); ASSIGN(F26); ASSIGN(F27); ASSIGN(F28); ASSIGN(F29);
  ASSIGN(F30); ASSIGN(F31); ASSIGN(F32); ASSIGN(F33); ASSIGN(F34);
  ASSIGN(F35); ASSIGN(F36); ASSIGN(F37); ASSIGN(F38); ASSIGN(F39);
  ASSIGN(F40); ASSIGN(F45); ASSIGN(F46); ASSIGN(F47); ASSIGN(F48);
  ASSIGN(F49); ASSIGN(F50); ASSIGN(F51); ASSIGN(F52);
  { auto v = obj["F52t"]; if (!v.isNull()) P.F52t = v.as<float>(); }
  ASSIGN(F53); ASSIGN(F54); ASSIGN(F55);
  #undef ASSIGN
}
static bool loadParams() {
  if (!ensureFs() || !LittleFS.exists(PARAMS_PATH)) return false;
  File f = LittleFS.open(PARAMS_PATH, "r");
  if (!f) return false;
  StaticJsonDocument<4096> doc;
  DeserializationError e = deserializeJson(doc, f);
  f.close();
  if (e) { Serial.printf("[PARAMS] JSON corrupto: %s\n", e.c_str()); return false; }
  if (doc.containsKey("updated_at")) g_paramsUpdatedAt = String((const char *)(doc["updated_at"] | ""));
  JsonObject obj = doc.containsKey("params") ? doc["params"].as<JsonObject>() : doc.as<JsonObject>();
  applyParamsFromJson(obj);
  return true;
}
static bool saveParams(JsonObject obj) {
  if (!ensureFs()) return false;
  StaticJsonDocument<4096> doc;
  doc["updated_at"] = g_paramsUpdatedAt;
  JsonObject p = doc.createNestedObject("params");
  for (JsonPair kv : obj) p[kv.key()] = kv.value();
  File f = LittleFS.open(PARAMS_PATH, "w");
  if (!f) return false;
  serializeJson(doc, f);
  f.close();
  return true;
}

/** Deriva la URL de fetch-pro300-params desde la URL de ingest-reading guardada. */
static String paramsUrl() {
  String u(g_cfg.apiUrl);
  int idx = u.lastIndexOf("/ingest-reading");
  if (idx > 0) {
    u.remove(idx);
    u += "/fetch-pro300-params";
    return u;
  }
  // Fallback: si el usuario puso otra URL, intentamos derivar igual.
  int slash = u.lastIndexOf('/');
  if (slash > 0) {
    u.remove(slash);
    u += "/fetch-pro300-params";
  }
  return u;
}

/**
 * Hace POST a fetch-pro300-params; si el server devolvió `updated_at` distinto al
 * que tenemos cacheado, aplica los nuevos AR y persiste a /params.json.
 */
static void pullParamsFromCloud() {
  if (WiFi.status() != WL_CONNECTED) { Serial.println(F("[PULL] sin WiFi, salto.")); return; }
  if (strlen(g_cfg.moduleId) == 0 || strlen(g_cfg.apiKey) == 0) {
    Serial.println(F("[PULL] sin moduleId/apiKey, salto."));
    return;
  }
  String url = paramsUrl();
  if (url.length() == 0) { Serial.println(F("[PULL] no pude derivar URL.")); return; }
  Serial.printf("[PULL] -> %s\n", url.c_str());

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(url)) { Serial.println(F("[PULL] http.begin() falló.")); return; }
  http.addHeader("Content-Type", "application/json");

  StaticJsonDocument<200> req;
  req["moduleId"]    = g_cfg.moduleId;
  req["deviceToken"] = g_cfg.apiKey;
  String body; serializeJson(req, body);

  int code = http.POST(body);
  String resp = http.getString();
  http.end();

  Serial.printf("[PULL] HTTP %d (%d bytes)\n", code, (int)resp.length());
  if (code != 200) {
    Serial.println(resp);
    return;
  }

  StaticJsonDocument<4096> doc;
  DeserializationError e = deserializeJson(doc, resp);
  if (e) {
    Serial.printf("[PULL] JSON error: %s\n", e.c_str());
    Serial.println(resp);
    return;
  }
  const char *upd = doc["updated_at"] | "";
  if (upd[0] && g_paramsUpdatedAt == upd) {
    Serial.printf("[PULL] sin cambios (updated_at=%s).\n", upd);
    return;
  }

  // Aceptamos doc["params"] como objeto principal, o doc raíz si la función
  // ya devuelve solo claves F* (fallback defensivo).
  JsonVariant pv = doc["params"];
  JsonObject obj = pv.is<JsonObject>() ? pv.as<JsonObject>() : doc.as<JsonObject>();
  if (obj.isNull()) {
    Serial.println(F("[PULL] respuesta sin 'params', no aplico."));
    Serial.println(resp);
    return;
  }
  if (obj.size() == 0) {
    Serial.printf("[PULL] 'params' vacío en el server. Setpoint/hist/... siguen en defaults.\n");
    g_paramsUpdatedAt = String(upd);
    return;
  }

  g_paramsUpdatedAt = String(upd);
  applyParamsFromJson(obj);
  saveParams(obj);
  Serial.printf("[PULL] AR actualizados desde la nube (%d claves, updated_at=%s).\n",
                (int)obj.size(), upd);
  Serial.printf("       F01=%.1f  F02=%.1f  F06=%.0fmin  F17=%.0fs  F18=%.0fs\n",
                P.F01, P.F02, P.F06, P.F17, P.F18);
  g_flashParamsUpdated = true;
}

// ============== Portal WiFiManager ==========
static void copyPortalConfigAndSave() {
  strlcpy(g_cfg.moduleId, p_module.getValue(), sizeof(g_cfg.moduleId));
  strlcpy(g_cfg.apiKey,   p_token.getValue(),  sizeof(g_cfg.apiKey));
  const char *u = p_url.getValue();
  if (u && strncmp(u, "https://", 8) == 0 && strstr(u, "/functions/v1/")) {
    strlcpy(g_cfg.apiUrl, u, sizeof(g_cfg.apiUrl));
  }
  saveConfig();
  Serial.println(F("[CFG] Guardado desde portal."));
}
/**
 * Abre el portal en modo no-bloqueante. El loop principal sigue corriendo
 * (display, watchdog, lectura de sondas, comandos serie), y procesa el portal
 * con `wm.process()` hasta que dispara la callback de save o se cumple el
 * timeout local que controlamos nosotros.
 */
static void runConfigPortal() {
  WiFi.mode(WIFI_AP_STA);
  WiFi.disconnect(true, true);
  delay(150);
  wm.setBreakAfterConfig(true);
  wm.setConfigPortalTimeout(PORTAL_TIMEOUT_SEC);
  wm.setConfigPortalBlocking(false);
  wm.startConfigPortal(AP_NAME);
  g_wifiState = WFS_PORTAL;
  g_portalStartedAt = millis();
  modoTexto = true;
  texto = "CONECTAR A RED PRO300-SETUP   ";
  scrollPos = 0;
  prepararTexto();
  Serial.printf("[WiFi] Portal '%s' abierto (modo no bloqueante, %lu s).\n", AP_NAME, PORTAL_TIMEOUT_SEC);
  Serial.println(F("[WiFi] Conéctate con el celular al SSID, abrí 192.168.4.1 y completá WiFi + Module ID + Token."));
}

/** Llamada continua desde loop() mientras g_wifiState == WFS_PORTAL. */
static void processPortal() {
  wm.process();
  if (g_portalSaveRequested) {
    copyPortalConfigAndSave();
    g_portalSaveRequested = false;
    Serial.println(F("[WiFi] Config guardada por el portal. Reiniciando para aplicar..."));
    delay(800);
    ESP.restart();
  }
  if (millis() - g_portalStartedAt > PORTAL_TIMEOUT_SEC * 1000UL) {
    Serial.println(F("[WiFi] Portal: timeout sin cambios. Sigo en control local; reintento WiFi cada 30 s."));
    wm.stopConfigPortal();
    g_wifiState = WFS_RUNNING;
    modoTexto = false;
  }
}
static bool connectSavedWifi() {
  Serial.printf("[WiFi] Probando WiFi guardado (máx. %lu ms)...\n", WIFI_BOOT_CONNECT_MS);
  WiFi.mode(WIFI_STA);
  WiFi.begin();
  unsigned long t0 = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - t0) < WIFI_BOOT_CONNECT_MS) {
    delay(200);
    yield();
    esp_task_wdt_reset();
  }
  return WiFi.status() == WL_CONNECTED;
}
static void setupWifi() {
  WiFi.setSleep(false);
  WiFi.persistent(true);
  wm.setConnectTimeout(15);
  wm.setMinimumSignalQuality(8);
  wm.setSaveConfigCallback([]() { g_portalSaveRequested = true; });
  p_module.setValue(g_cfg.moduleId, sizeof(g_cfg.moduleId) - 1);
  p_token.setValue(g_cfg.apiKey,    sizeof(g_cfg.apiKey)    - 1);
  p_url.setValue(g_cfg.apiUrl,      sizeof(g_cfg.apiUrl)    - 1);
  wm.addParameter(&p_module);
  wm.addParameter(&p_token);
  wm.addParameter(&p_url);

  bool forcePortal = digitalRead(PIN_FORCE_PORTAL) == LOW;
  bool noConfig    = strlen(g_cfg.moduleId) == 0 || strlen(g_cfg.apiKey) == 0;
  if (forcePortal || noConfig) {
    Serial.println(forcePortal ? F("[WiFi] BOOT a GND → portal forzado.")
                               : F("[WiFi] Sin config → portal automático."));
    runConfigPortal();
    return;
  }
  if (!connectSavedWifi()) {
    Serial.println(F("[WiFi] No conectó en boot. Sigo control local; reintento cada 30 s."));
  } else {
    Serial.printf("[WiFi] OK: SSID=%s IP=%s RSSI=%d\n",
      WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(), (int)WiFi.RSSI());
  }
  g_wifiState = WFS_RUNNING;
}
// Reintento de WiFi vive ahora en networkTask() (core 0).

