arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro300_cd4094/esp32_pro300_cd4094.ino
// ============== Telemetría ==================
static void enviarTelemetria() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (strlen(g_cfg.moduleId) == 0 || strlen(g_cfg.apiKey) == 0) return;
  HTTPClient http;
  http.setTimeout(8000);
  http.begin(g_cfg.apiUrl);
  http.addHeader("Content-Type", "application/json");

  String body = "{";
  body += "\"moduleId\":\"";    body += g_cfg.moduleId;  body += "\",";
  body += "\"deviceToken\":\""; body += g_cfg.apiKey;    body += "\",";
  if (!fault1) { body += "\"temp1_c\":" + String(tCam, 2)  + ","; }
  else         { body += "\"temp1_c\":null,"; }
  if (!fault2) { body += "\"temp2_c\":" + String(tEvap, 2); }
  else         { body += "\"temp2_c\":null"; }
  body += ",\"comp_on\":"    + String(compresor  ? "true" : "false");
  body += ",\"fan_on\":"     + String(ventilador ? "true" : "false");
  body += ",\"defrost_on\":" + String(deshielo   ? "true" : "false");
  // Snapshot de fase + cronómetro (para que la card del PRO300 muestre
  // Transcurrido/Faltan/etc. en cualquier bloque, no solo deshielo).
  uint32_t phaseElapsedS = (uint32_t)((millis() - g_phaseStartedAt) / 1000UL);
  body += ",\"phase\":\"";          body += phaseName(g_phase);  body += "\"";
  body += ",\"phase_elapsed_s\":" + String(phaseElapsedS);
  body += ",\"phase_total_s\":"   + String(g_phaseTotalS);
  if (DOOR_PIN >= 0 && P.F25 >= 0.5f) {
    body += ",\"door_open\":" + String(doorOpen ? "true" : "false");
  }
  body += "}";

  int code = http.POST(body);
  String resp = http.getString();
  Serial.print(F("[TX] POST ")); Serial.print(code);
  if (code > 0) { Serial.print(' '); Serial.println(resp); }
  else          { Serial.println(); }
  http.end();
  if (code != 200) return;

  g_flashTelemetrySent = true;

  // Atajo de propagación: si el server nos cuenta que `params_updated_at` del
  // combistato es más nuevo que el que tenemos, pedimos un pull inmediato.
  // Así editás un AR en la app y a los pocos segundos lo aplica el equipo.
  StaticJsonDocument<512> doc;
  if (deserializeJson(doc, resp) == DeserializationError::Ok) {
    const char *pu = doc["params_updated_at"] | "";
    if (pu[0] && g_paramsUpdatedAt != pu) {
      Serial.printf("[TX] Detecté params nuevos (%s vs %s) → forzando pull.\n",
                    g_paramsUpdatedAt.c_str(), pu);
      g_pullNowRequested = true;
    }
  }
}

// ============== Comandos serie ==============
static void printConfig() {
  Serial.println(F("---- CONFIG ----"));
  Serial.printf("WiFi SSID: %s  (status=%d)\n", WiFi.SSID().c_str(), WiFi.status());
  Serial.printf("api_url:   %s\n", g_cfg.apiUrl);
  Serial.printf("module_id: %s\n", g_cfg.moduleId);
  Serial.printf("api_key:   %s\n", g_cfg.apiKey);
  Serial.printf("interval:  %lu ms\n", (unsigned long)g_cfg.intervalMs);
  Serial.printf("params updated_at: %s\n", g_paramsUpdatedAt.c_str());
  Serial.println(F("---- AR vigentes ----"));
  Serial.printf("AR01 F01 setpoint     = %.1f\n", P.F01);
  Serial.printf("AR02 F02 hist         = %.1f\n", P.F02);
  Serial.printf("AR03 F03 offS1        = %.1f\n", P.F03);
  Serial.printf("AR04 F04 offS2        = %.1f\n", P.F04);
  Serial.printf("AR05 F49 modo (0fri)  = %.0f\n", P.F49);
  Serial.printf("AR06 F50 inv. relé    = %.0f\n", P.F50);
  Serial.printf("AR07 F53 sonda ctrl   = %.0f\n", P.F53);
  Serial.printf("AR08 F54 muestras     = %.0f\n", P.F54);
  Serial.printf("AR10 F06 int defrost  = %.0f min\n", P.F06);
  Serial.printf("AR11 F07 max defrost  = %.0f min\n", P.F07);
  Serial.printf("AR12 F08 fin defrost  = %.1f\n", P.F08);
  Serial.printf("AR14 F38 boot delay   = %.0f s\n", P.F38);
  Serial.printf("AR15 F39 goteo        = %.0f min\n", P.F39);
  Serial.printf("AR20 F10 fan en def   = %.0f\n", P.F10);
  Serial.printf("AR21 F11 ret fan post = %.0f min\n", P.F11);
  Serial.printf("AR23 F51 fan continuo = %.0f\n", P.F51);
  Serial.printf("AR24 F13 alarma alta  = %.1f\n", P.F13);
  Serial.printf("AR25 F14 alarma baja  = %.1f\n", P.F14);
  Serial.printf("AR30 F17 tmin OFF     = %.0f s\n", P.F17);
  Serial.printf("AR31 F18 tmin ON      = %.0f s\n", P.F18);
  Serial.printf("AR34 F55 emerg falla  = %.0f\n", P.F55);
  Serial.println(F("--------------------"));
}
static void leerSerial() {
  if (!Serial.available()) return;
  String dato = Serial.readStringUntil('\n');
  dato.trim();
  if (dato.length() == 0) return;
  String lower = dato; lower.toLowerCase();

  if (lower == "portal")  { runConfigPortal(); return; }
  if (lower == "reset")   { Serial.println(F("Reseteando config...")); resetConfig(); return; }
  if (lower == "config")  { printConfig(); return; }
  if (lower == "reboot")  { ESP.restart(); return; }
  if (lower == "temp")    { modoTexto = false; return; }
  if (lower == "pull")    { Serial.println(F("[PULL] solicitando pull a la task de red...")); g_pullNowRequested = true; return; }
  if (lower == "off") {
    compresor = ventilador = deshielo = false;
    modoTexto = true; texto = "OFF"; scrollPos = 0; prepararTexto();
    return;
  }
  if (lower == "defrost" || lower == "deshielo") {
    lastDefrostAt = 0;
    Serial.println(F("Forzando deshielo en próximo tick."));
    return;
  }
  modoTexto = true;
  texto = dato; scrollPos = 0; prepararTexto();
}

// ============== Display task (core 1, prio 2) ==============
/**
 * Multiplexa los 5 comunes (4 dígitos + fila de luces) escribiendo cada uno
 * cada `kPeriodMs` ticks. Como vTaskDelay devuelve el control a FreeRTOS,
 * cualquier otra task de igual o menor prioridad (loop=1) corre entre cada
 * refresco. Con prio 2 quedamos por encima del loop y nos garantizamos que
 * los logs / NTC / SPI ocasionales no le coman ciclos al display.
 */
static void displayTask(void *param) {
  // El bus SPI lo inicializó setup(). beginTransaction asegura que estamos
  // configurados con MSBFIRST/MODE0/1MHz desde esta task (no liberamos: nadie
  // más usa el bus).
  SPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
  const TickType_t kPeriod = pdMS_TO_TICKS(1);
  for (;;) {
    refrescarDisplay();
    vTaskDelay(kPeriod);
  }
}

