arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro300_cd4094/esp32_pro300_cd4094.ino
// ============== Network task (core 0) =======
/**
 * Corre en core 0 y se ocupa de:
 *   - reintento de WiFi cuando se cae,
 *   - POST de telemetría cada g_cfg.intervalMs,
 *   - pull periódico de AR desde Supabase (PARAMS_PULL_MS) o on-demand desde Serial.
 * El loop principal (core 1) queda libre para multiplexar el 7-seg y atender los
 * cálculos de control sin que un POST HTTP de varios segundos congele el display.
 */
static void networkTask(void *param) {
  esp_task_wdt_add(NULL);
  unsigned long lastTel = 0;
  unsigned long lastPull = 0;
  unsigned long lastRetry = 0;
  for (;;) {
    esp_task_wdt_reset();

    if (g_wifiState == WFS_RUNNING) {
      // Reintentar WiFi si se cayó.
      if (WiFi.status() != WL_CONNECTED) {
        if (lastRetry == 0 || (millis() - lastRetry) >= 30000UL) {
          lastRetry = millis();
          if (WiFi.SSID().length() > 0) {
            Serial.println(F("[WiFi] Reintentando (task)..."));
            WiFi.reconnect();
          }
        }
      } else {
        if (millis() - lastTel >= g_cfg.intervalMs) {
          lastTel = millis();
          enviarTelemetria();
        }
        if (g_pullNowRequested || (millis() - lastPull >= PARAMS_PULL_MS)) {
          lastPull = millis();
          g_pullNowRequested = false;
          pullParamsFromCloud();
        }
      }
    }

    vTaskDelay(pdMS_TO_TICKS(200));
  }
}

// ============== Setup / Loop ================
void setup() {
  Serial.begin(115200);
  pinMode(STROBE_PIN, OUTPUT);
  digitalWrite(STROBE_PIN, LOW);
  pinMode(PIN_FORCE_PORTAL, INPUT_PULLUP);
  if (DOOR_PIN >= 0) pinMode(DOOR_PIN, INPUT_PULLUP);
  analogReadResolution(12);

  SPI.begin(CLOCK_PIN, -1, DATA_PIN, -1);
  // Inicializa los 4094 con todo apagado. Cerramos la transacción para
  // liberar el mutex interno del SPI; si no, displayTask se queda esperando
  // para siempre cuando intenta su propio beginTransaction() → display negro.
  SPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
  enviar4094(comunesApagados(), 0xFF);
  SPI.endTransaction();

  Serial.println();
  Serial.println(F("S.G PRO300 booteando..."));
  ensureFs();
  loadConfig();
  loadParams();
  printConfig();

  // Watchdog: 30 s (suficiente para conexiones WiFi lentas + portal).
#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t twdt_cfg = {
    .timeout_ms     = 30000,
    .idle_core_mask = 0,
    .trigger_panic  = true,
  };
  if (esp_task_wdt_init(&twdt_cfg) == ESP_ERR_INVALID_STATE) {
    esp_task_wdt_reconfigure(&twdt_cfg);
  }
#else
  esp_task_wdt_init(30, true);
#endif
  esp_task_wdt_add(NULL);

  bootAtMs = millis();
  bootDelayDone = false;
  defrostOnStartDone = false;
  emergencyChangedAt = bootAtMs;
  compChangedAt = bootAtMs;
  lastDefrostAt = bootAtMs;

  texto = "BOOT"; prepararTexto();

  setupWifi();
  if (g_wifiState != WFS_PORTAL) modoTexto = false;

  // Si ya está conectado al arrancar, marcamos pull inmediato para que la task
  // de red lo levante en cuanto comience (no bloqueamos el setup con HTTP).
  if (WiFi.status() == WL_CONNECTED) {
    g_pullNowRequested = true;
  }

  // Network task en core 0 para que los POST/HTTPS no congelen el display.
  xTaskCreatePinnedToCore(
    networkTask,        // función
    "net",              // nombre
    8192,               // stack
    NULL,               // parámetro
    1,                  // prioridad (loop = 1 por default)
    &g_netTaskHandle,   // handle
    0                   // core 0
  );

  // Display task en core 1 con prioridad mayor que loopTask. Refresca el
  // multiplex cada 1 ms sin que el resto del firmware le robe ciclos.
  xTaskCreatePinnedToCore(
    displayTask,
    "disp",
    2048,
    NULL,
    2,
    &g_displayTaskHandle,
    1                   // core 1, junto al loop pero con prio más alta
  );
}

void loop() {
  esp_task_wdt_reset();
  leerSerial();

  if (g_wifiState == WFS_PORTAL) processPortal();

  // Refresco del display vive ahora en displayTask (core 1, prio 2).
  // El loop solo se ocupa de control, NTC, marquesinas y portal.

  if (millis() - lastReadAt >= 1000) {
    lastReadAt = millis();
    tCam  = leerNTCpromedio(NTC1_PIN, fault1, P.F03);
    tEvap = leerNTCpromedio(NTC2_PIN, fault2, P.F04);
    leerPuerta();
    aplicarControl();
    evaluarAlarmas();
  }

  // ---- Mensajes efímeros en marquesina (TX OK / AR actualizados) ----
  // Se disparan desde networkTask en core 0; el loop arma el scroll y vuelve a
  // temperatura cuando vence el timeout. No se activan durante el portal.
  if (g_wifiState != WFS_PORTAL) {
    if (g_flashTelemetrySent) {
      g_flashTelemetrySent = false;
      g_flashActive = true;
      modoTexto = true;
      texto = "DATOS ENVIADOS   ";
      scrollPos = 0;
      prepararTexto();
      g_flashEndsAt = millis() + 3500UL;
    } else if (g_flashParamsUpdated) {
      g_flashParamsUpdated = false;
      g_flashActive = true;
      modoTexto = true;
      texto = "DATOS CARGADOS   ";
      scrollPos = 0;
      prepararTexto();
      g_flashEndsAt = millis() + 3500UL;
    }
  }
  if (g_flashActive && millis() >= g_flashEndsAt) {
    g_flashActive = false;
    modoTexto = false;
  }

  if (modoTexto && millis() - lastScroll >= 300) {
    lastScroll = millis();
    prepararTexto();
  }
  if (!modoTexto && millis() - lastDisplaySwitchAt >= 1000) {
    lastDisplaySwitchAt = millis();
    if (fault1) mostrarError(1);
    else        mostrarTemperatura(tCam);
  }

  // OJO: la telemetría, pull de AR y reintento de WiFi viven ahora en
  // networkTask() pinneada al core 0. El loop solo se ocupa del display,
  // sondas, control y portal.
}
